AWSCloudTrail
| where EventName has_any ("DeactivateMFADevice", "DeleteVirtualMFADevice", "DeleteLoginProfile", "DeleteServiceSpecificCredential", "DeleteSSHPublicKey", "DeleteSigningCertificate", "DeleteAccessKey")
