// Threat actors were able to set the CorrelationId of the authentication to the same value as the TenantId that receives the authentication
// This peculiar activity ceased on 20th November 2025
SigninLogs
| where CorrelationId == AADTenantId or CorrelationId == HomeTenantId or CorrelationId == HomeTenantId or CorrelationId == AppOwnerTenantId or CorrelationId == ResourceOwnerTenantId
// | where App == "0ec893e0-5785-4de6-99da-4ed124e5296c"// Microsoft 365 Copilot
// | where ResourceIdentity == "4765445b-32c6-49b0-83e6-1d93765276ca"// OfficeHome
// | where isempty(UserAgent)
