SecurityEvent
| where EventData has_any ("CN=Partitions,CN=Configuration,", "msExchAcceptedDomain", "msDS-DelegatedManagedServiceAccount", "msDS-ManagedAccountPrecededByLink")
| project
    TimeGenerated,
    Computer,
    Account,
    AccountType,
    Activity,
    OperationType,
    EventData,
    SubjectLogonId
